# Args
cask_args appdir: '/Applications'

# Taps
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions' # alternative versions of Casks. etc) alfred, firefox, intellji

tap 'universal-ctags/universal-ctags' # ctags

# Binaries

## shell
brew 'ack'
brew 'asdf'
brew 'bat'
brew 'binutils'
brew 'coreutils'
brew 'cloc'
brew 'exa'
brew 'fd'
brew 'fish'
brew 'fzf'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnupg'
brew 'gnutls'
brew 'grep'
brew 'gzip'
brew 'gettext'
brew 'jq'
brew 'pinentry'
brew 'pstree'
brew 'readline'
brew 'ripgrep'
brew 'rsync'
brew 'tmux'
brew 'tree'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD', 'with-libyaml', 'with-jansson']
brew 'unzip'
brew 'watch'
brew 'zsh'
brew 'zsh-completions'

## git
brew 'git'
brew 'diff-so-fancy'
brew 'git-extras'
##brew 'git-flow-avh'
brew 'git-recent'
brew 'gitmoji'
brew 'grv'
brew 'tig'

## build
brew 'autoconf'
brew 'automake'
brew 'gcc'
brew 'make'

## dev - env - should be replaced with asdf
brew 'autoenv'
brew 'direnv'
brew 'goenv'
brew 'nvm'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rbenv'
brew 'tfenv'

## dev - cloud
brew 'ansible'
brew 'awscli'
brew 'awslogs'
brew 'aws-shell'
brew 'azure-cli'

## dev - docker
brew 'docker-completion'
brew 'minikube'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'helmfile'

## dev - network & security
brew 'adns'
brew 'arp-scan'
brew 'arping'
brew 'hping'
brew 'geoip'
brew 'iproute2mac'
brew 'iperf3'
brew 'netcat'
brew 'nmap'
brew 'nikto'
brew 'mosh'
# brew 'openssl@1.1' - will be manually installed, see docs folder
brew 'socat'
brew 'ssh-copy-id'
brew 'sqlmap'
brew 'tcpdump'
brew 'telnet'
brew 'theharvester'
brew 'whois'
brew 'wireguard-tools'

## dev - http testing
brew 'curl'
brew 'hey'
brew 'httpie'
brew 'jmeter'
brew 'k6'
brew 'wget'
brew 'wrk'
brew 'vegeta'

## font - https://github.com/Homebrew/homebrew-cask-fonts/tree/master/Casks
cask 'font-fantasque-sans-mono-nerd-font'
cask 'font-fira-code-nerd-font'
cask 'font-hack-nerd-font'

## monitoring
brew 'iftop'
brew 'htop'
brew 'bpytop'
brew 'hacker1024/hacker1024/coretemp'

## tools
brew 'asciinema'
brew 'ffmpeg'
brew 'mas'
brew 'kafkacat'
brew 'hashcat'
brew 'thefuck'
brew 'tokei'
brew 'translate-shell'
brew 'youtube-dl'

# Apps
cask 'appcleaner'
# cask 'avast-security', failed
cask 'colorpicker-materialdesign'
cask 'firefox-developer-edition'
cask 'grammarly'
cask 'iterm2'
cask 'kitty'
cask 'lens'
cask 'maccy'
cask 'ngrok'
# cask 'osxfuse', not supported in M1
cask 'postman'
cask 'slack'
cask 'sequel-pro'
cask 'spectacle'
cask 'stats'
cask 'toinane-colorpicker'
cask 'the-unarchiver'
cask 'transmission'
cask 'tunnelblick'
# cask 'visual-studio-code', will be manually installed with its arm version
cask 'vlc'
cask 'wireshark'

# Quicklook
#cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'
cask 'quicklookase'
cask 'suspicious-package'
cask 'webpquicklook'

# Mac App Store
mas 'Xcode', id: 497799835
mas 'myTuner Radio', id: 881415018
mas 'HWP Viewer', id: 416746898
mas 'Slack', id: 803453959
mas 'The Unarchiver', id: 425424353
mas 'VPN Unlimited', id: 727593140
mas 'WireGuard', id: 1451685025
mas 'Unicorn HTTPS', id: 1475628500
